MCUdude/MightyCore/avr/boards.txt
644.menu.clock.8MHz_external=External 8 MHz
644.menu.clock.8MHz_external.upload.speed=57600
644.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.8MHz_external.build.f_cpu=8000000L

644.menu.clock.7_3728MHz_external=External 7.3728 MHz
644.menu.clock.7_3728MHz_external.upload.speed=115200
644.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

644.menu.clock.3_6864MHz_external=External 3.6864 MHz
644.menu.clock.3_6864MHz_external.upload.speed=115200
644.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

644.menu.clock.1_8432MHz_external=External 1.8432 MHz
644.menu.clock.1_8432MHz_external.upload.speed=115200
644.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

644.menu.clock.8MHz_internal=Internal 8 MHz
644.menu.clock.8MHz_internal.upload.speed=38400
644.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
644.menu.clock.8MHz_internal.build.f_cpu=8000000L

644.menu.clock.1MHz_internal=Internal 1 MHz
644.menu.clock.1MHz_internal.upload.speed=9600
644.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
644.menu.clock.1MHz_internal.build.f_cpu=1000000L




##########################
#### ATmega324A/P/PA  ####
##########################

# General
324.name=ATmega324
324.upload.tool=avrdude
324.upload.maximum_data_size=2048
324.bootloader.tool=avrdude
324.bootloader.unlock_bits=0x3f
324.bootloader.lock_bits=0x0f
324.build.core=MCUdude_corefiles
324.build.board=AVR_ATmega324

# Upload port select
324.menu.bootloader.uart0=Yes (UART0)
324.menu.bootloader.uart0.upload.maximum_size=32256
324.menu.bootloader.uart0.upload.protocol=arduino
324.menu.bootloader.uart0.upload.port=UART0
324.menu.bootloader.uart0.bootloader.high_fuses=0xd6
324.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}.hex

324.menu.bootloader.uart1=Yes (UART1)
324.menu.bootloader.uart1.upload.maximum_size=32256
324.menu.bootloader.uart1.upload.protocol=arduino
324.menu.bootloader.uart1.upload.port=UART1
324.menu.bootloader.uart1.bootloader.high_fuses=0xd6
324.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}.hex

324.menu.bootloader.uart2=Yes (UART2 324PB only)
324.menu.bootloader.uart2.upload.maximum_size=32256
324.menu.bootloader.uart2.upload.protocol=arduino
324.menu.bootloader.uart2.upload.port=UART2
324.menu.bootloader.uart2.bootloader.high_fuses=0xd6
324.menu.bootloader.uart2.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}.hex

324.menu.bootloader.no_bootloader=No bootloader
324.menu.bootloader.no_bootloader.upload.maximum_size=32768
324.menu.bootloader.no_bootloader.bootloader.high_fuses=0xd7
324.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Pinouts
324.menu.pinout.standard=Standard pinout
324.menu.pinout.standard.build.variant=standard
324.menu.pinout.standard.build.bootloader_led=B0
324.menu.pinout.bobuino=Bobuino pinout
324.menu.pinout.bobuino.build.variant=bobuino
324.menu.pinout.bobuino.build.bootloader_led=B7
324.menu.pinout.sanguino=Sanguino pinout
324.menu.pinout.sanguino.build.variant=sanguino
324.menu.pinout.sanguino.build.bootloader_led=B0

# Variants
324.menu.variant.modelP=324P
324.menu.variant.modelP.bootloader.cksel_bits=0111
324.menu.variant.modelP.bootloader.cfd_bit=1
324.menu.variant.modelP.build.mcu=atmega324p
324.menu.variant.modelPA=324PA
324.menu.variant.modelPA.bootloader.cksel_bits=0111
324.menu.variant.modelPA.bootloader.cfd_bit=1
324.menu.variant.modelPA.build.mcu=atmega324pa
324.menu.variant.modelA=324A
324.menu.variant.modelA.bootloader.cksel_bits=0111
324.menu.variant.modelA.bootloader.cfd_bit=1
324.menu.variant.modelA.build.mcu=atmega324a
324.menu.variant.modelPB=324PB
324.menu.variant.modelPB.bootloader.cksel_bits=1111
324.menu.variant.modelPB.bootloader.cfd_bit=0
324.menu.variant.modelPB.build.mcu=atmega324pb

# Brown out detection
324.menu.BOD.2v7=BOD 2.7V
324.menu.BOD.2v7.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}101
324.menu.BOD.4v3=BOD 4.3V
324.menu.BOD.4v3.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}100
324.menu.BOD.1v8=BOD 1.8V
324.menu.BOD.1v8.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}110
324.menu.BOD.disabled=BOD disabled
324.menu.BOD.disabled.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}111

# Compiler link time optimization
324.menu.LTO.Os=LTO disabled
324.menu.LTO.Os.compiler.c.extra_flags=
324.menu.LTO.Os.compiler.c.elf.extra_flags=
324.menu.LTO.Os.compiler.cpp.extra_flags=
324.menu.LTO.Os.ltoarcmd=avr-ar

324.menu.LTO.Os_flto=LTO enabled
324.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
324.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
324.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
324.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
324.menu.clock.16MHz_external=External 16 MHz
324.menu.clock.16MHz_external.upload.speed=115200
324.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.16MHz_external.build.f_cpu=16000000L

324.menu.clock.20MHz_external=External 20 MHz
324.menu.clock.20MHz_external.upload.speed=115200
324.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.20MHz_external.build.f_cpu=20000000L

324.menu.clock.18_432MHz_external=External 18.4320 MHz
324.menu.clock.18_432MHz_external.upload.speed=115200
324.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.18_432MHz_external.build.f_cpu=18432000L

324.menu.clock.14_7456MHz_external=External 14.7456 MHz
324.menu.clock.14_7456MHz_external.upload.speed=115200
324.menu.clock.14_7456MHz_external.bootloader.low_fuses=low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

324.menu.clock.12MHz_external=External 12 MHz
324.menu.clock.12MHz_external.upload.speed=57600
324.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.12MHz_external.build.f_cpu=12000000L

324.menu.clock.11_0592MHz_external=External 11.0592 MHz
324.menu.clock.11_0592MHz_external.upload.speed=115200
324.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

